app/Controllers/Home.php

SELECT *
FROM `users`
WHERE `username` = 'alpha88'
AND `password` = '@Nexxian31'
 LIMIT 1
---
    public function login()
    {
        if ($_SERVER['REQUEST_METHOD'] === 'POST') {
            $username = $this->request->getPost('username');
            $pass = $this->request->getPost('password');

            $user = $this->db->table('users')
                ->where('username', $username)
                ->where('password', $pass)
                ->limit(1)
                ->get()
                ->getRow();

INSERT INTO `log_users` (`uid`, `username`, `nama`, `aktivitas`, `gelanggang`) VALUES ('1507', 'alpha88', 'WAHYU WIJAYA', 'WAHYU WIJAYA Keluar dari Aplikasi', NULL)
---
    public function logout()
    {
        $db = db_connect();
        $logsuser = array(
            'uid' => session()->uid,
            'username' => session()->username,
            'nama' => session()->namaLengkap,
            'aktivitas' => session()->namaLengkap . ' Keluar dari Aplikasi',
            'gelanggang' => session()->gelanggang,
        );
        $db->table('log_users')->insert($logsuser);