app/Controllers/Juri.php

SELECT *
FROM `jadwal_tanding`
WHERE `aktif` = 1
 LIMIT 1
---
    public function index()
    {
        if (!session()->user_logged) {
            session_destroy();
            return redirect()->to(base_url());
        }
        $method = $_SERVER['REQUEST_METHOD'];
        switch ($method) {
            case 'GET':
                $data['title'] = 'Juri';
                $data['juri'] = array(
                    'nama' => Session('namaLengkap'),
                    'uid' => Session('uid'),
                    'auth_key' => Session('auth_key'),
                    'title_name' => Session('title_name'),
                );
                return view('juri/index', $data);
                break;
            case 'POST':
                if (isset($_POST['gelanggang'])) {
                    // session()->set($dt);
                    $data['data'] = null;
                    $data['title'] = 'Penilaian Juri';
                    $q = $this->db->table('jadwal_tanding')
                        ->where('aktif', 1)
                        ->limit(1)
                        ->get()
                        ->getRow();

INSERT INTO `log_users` (`uid`, `username`, `nama`, `aktivitas`, `gelanggang`) VALUES ('1001', 'juri1', 'Subagio', 'Subagio Masuk sebagai Juri1', 'A')
---
                        'gelanggang' => session()->gelanggang,
                    );
                    $db = db_connect();
                    $db->table('log_users')->insert($logsuser);